$(window).scroll(function (){
		//判断滚动距离
		var top=$(window).scrollTop();
		//滚动距离大于400 显示 否则隐藏
		if(top>190){
			$("#aplayer").fadeIn().show();
		}else{
			$("#aplayer").hide().fadeOut();
		}	
	})
const ap = new APlayer({
    container: document.getElementById('aplayer'),
    autoplay: false,
    loop: 'all',
	order: 'list',
    volume: 0.7,
    fixed: true,
	mutex: true,
	listMaxHeight: 60,
	lrcType: 1,
    audio: [
		{
            name: 'Between Worlds',
            artist: 'Roger Subirana',
            url: 'http://www.ytmp3.cn/down/37223.mp3',
            cover: 'http://p1.music.126.net/nwm22daKr-Dvo1WH4_7Hdw==/109951164025569407.jpg',
			lrc: '[00:05.74]纯音乐，请欣赏'
        },
		{
            name: 'Between Worlds',
            artist: 'Roger Subirana',
            name: '处处吻',
            artist: '杨千桦',
            url: 'http://www.ytmp3.cn/down/58841.mp3',
            cover: 'http://p1.music.126.net/8w4C39C2OY2fRANvkSXo9Q==/109951163270254519.jpg',
			lrc: '[00:06.74]作曲／编曲／监制：雷颂德\n[00:11.74]填词：林夕\n[00:17.44]你爱人吻却永不爱人\n[00:21.51]练习围浪但是怕熟人\n[00:25.44]你爱路过去索取见闻\n[00:29.52]陌路人便特别有份好感\n[01:30.04][00:33.86]＊你亦爱别离　再合再离\n[01:33.24][00:37.04]似花瓣献技　叫花粉遍鼻\n[01:38.08][00:41.10]你在播弄这穿线游戏\n[01:41.29][00:45.06]跟他结束　他与她再一起\n[01:45.21][00:48.92]你小心　一吻便颠倒众生\n[01:47.84][00:51.67]一吻便救一个人\n[01:49.83][00:53.55]给你拯救的体温\n[01:51.82][00:55.71]总会再捐给某人\n[01:53.83][00:57.49]一吻便偷一个心\n[01:55.74][00:59.61]一吻便杀一个人\n[01:57.75][01:01.62]一串敏感一串金\n[01:59.86][01:03.52]一秒崎岖的旅行＊\n[01:06.14]有半夜情人延续吻别人\n[01:09.84]让你旧情人　又维护他人\n[01:13.69]每晚大概有上亿个人\n[01:17.75]在地球上落力的亲吻\n[01:21.62]你那习惯　散播给众人\n[01:25.74]在地球上为踏遍及世人\n[02:03.81]你为何未曾尽兴\n[02:06.85]不休的爱情　跳蚤的旅程\n[02:09.49]天　铺天盖地　可管领\n[02:13.45]这变轨的爱情　播种的旅程\n[02:17.00]别了他　他吻她　他吻她吻他吻她\n[02:20.81]延续愉快过程 别了他怎高兴\n[02:24.91]下个他　他吻她　他吻她再跟你结束这旅程\n[02:30.54]多得你这煞景\n[02:33.55]你小心　一吻便颠倒众生　一吻便救一个人\n[02:37.92]给你拯救的体温　总会再捐给某人\n[02:41.87]一吻便偷一个心　一吻便杀一个人\n[02:46.05]一串敏感一串金　一秒崎岖的旅行\n[02:50.11]他吻她　他吻她吻他吻她\n[02:53.00]延续地愉快过程（你我他怎高兴）\n[02:57.10]下个他　他吻她　他吻她吻他吻她\n[03:00.87]延续地愉快过程（你我他真高兴）\n[03:05.29]十个他　千个他　因爱布景的旅程'
        },
        {
            name: '百火撩乱',
            artist: 'kalafina',
            url: 'http://rl01.sycdn.kuwo.cn/8d2c20f4b5088dc298d32fb6de4ac44f/5d526045/resource/n2/33/71/3294062883.mp3',
            cover: 'https://cn-south-17-aplayer-46154810.oss.dogecdn.com/hikarunara.jpg',
			lrc: '[00:00.00]APlayer\n[00:04.01]is\n[00:08.02]amazing'
        }
    ]
});